# Chap4.1

Exercise 4.1.1

In [1]:
import pandas as pd
#n1. 
S1 = pd.Series({"동원" : 100, "가연" : 90, "희진" : 80})
S2 = pd.Series({"한솔" : 80, "가연" : 100, "희진" : 95})

In [2]:
#n2. 
S1 + S2

가연    190.0
동원      NaN
한솔      NaN
희진    175.0
dtype: float64

In [3]:
S1 / S2

가연    0.900000
동원         NaN
한솔         NaN
희진    0.842105
dtype: float64

In [4]:
S1 * S2

가연    9000.0
동원       NaN
한솔       NaN
희진    7600.0
dtype: float64

In [5]:
S1 - S2

가연   -10.0
동원     NaN
한솔     NaN
희진   -15.0
dtype: float64

Exercise 4.1.2

In [6]:
Grade = pd.DataFrame({
    "신호및시스템" : [3.5, 4.0, 4.5, 4.5, 2.0],
    "제어공학" : ['P', 'P', 'P', 'P', 'F'],
    "수리통계학(I)" : [3, 4, 4, 3, 2],
    "머신러닝" : ['A+', 'A', 'B', 'C', 'A+'],
    "딥러닝" : ["미입력", "미입력", "미입력", "미입력", "미입력"]}, 
    index = ['민수', '호동', '철수', '영희', '가연'])
Grade

    신호및시스템 제어공학  수리통계학(I) 머신러닝  딥러닝
민수     3.5    P         3   A+  미입력
호동     4.0    P         4    A  미입력
철수     4.5    P         4    B  미입력
영희     4.5    P         3    C  미입력
가연     2.0    F         2   A+  미입력

Exercise 4.1.3

In [7]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [8]:
#n1.
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [9]:
#n2
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [10]:
#n3. 
df["평균"] = (df["국어"] + df["영어"] + df["수학"])/3   
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [11]:
#n4. 
df.loc['방자', '영어'] = 80
df["평균"] = (df["국어"] + df["영어"] + df["수학"])/3   
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [12]:
#n5. 
pd.DataFrame(df.T['춘향'])

           춘향
국어  80.000000
영어  90.000000
수학  90.000000
평균  86.666667

In [13]:
#n6.
df.loc['향단', :]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

# Chap4.3

Exercise 4.3.1

In [14]:
import numpy as np
data = np.random.randint(10, size = (5,5))
index = ['id1', 'id2', 'id3', 'id4', 'id5']
col = ['col1', 'col2', 'col3', 'col4', 'col5']
df = pd.DataFrame(data = data, index = index, columns = col)
df

     col1  col2  col3  col4  col5
id1     2     3     7     4     4
id2     0     3     0     1     1
id3     1     4     2     0     5
id4     1     1     5     8     8
id5     7     1     3     3     1

In [15]:
# case1
df.loc["id1", :]

col1    2
col2    3
col3    7
col4    4
col5    4
Name: id1, dtype: int64

In [16]:
# case2
df.loc["id1", 'col3']

7

In [17]:
# case3
df.loc[[fea for fea in df.index], :]

     col1  col2  col3  col4  col5
id1     2     3     7     4     4
id2     0     3     0     1     1
id3     1     4     2     0     5
id4     1     1     5     8     8
id5     7     1     3     3     1

In [18]:
# case4
df.iloc[range(3), range(2)]

     col1  col2
id1     2     3
id2     0     3
id3     1     4

In [19]:
# case5
df.iloc[3,2]

5

In [20]:
# case6
df.iloc[1:, 1:]

     col2  col3  col4  col5
id2     3     0     1     1
id3     4     2     0     5
id4     1     5     8     8
id5     1     3     3     1

In [21]:
# case7
df.iloc[:3, :]

     col1  col2  col3  col4  col5
id1     2     3     7     4     4
id2     0     3     0     1     1
id3     1     4     2     0     5

# Chap4.4

Exercise 4.4.1

In [22]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [23]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

Exercise 4.4.2

In [24]:
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [25]:
titanic['age'].value_counts().sort_index()

0.42      1
0.67      1
0.75      2
0.83      2
0.92      1
1.00      7
2.00     10
3.00      6
4.00     10
5.00      4
6.00      3
7.00      3
8.00      4
9.00      8
10.00     2
11.00     4
12.00     1
13.00     2
14.00     6
14.50     1
15.00     5
16.00    17
17.00    13
18.00    26
19.00    25
20.00    15
20.50     1
21.00    24
22.00    27
23.00    15
23.50     1
24.00    30
24.50     1
25.00    23
26.00    18
27.00    18
28.00    25
28.50     2
29.00    20
30.00    25
30.50     2
31.00    17
32.00    18
32.50     2
33.00    15
34.00    15
34.50     1
35.00    18
36.00    22
36.50     1
37.00     6
38.00    11
39.00    14
40.00    13
40.50     2
41.00     6
42.00    13
43.00     5
44.00     9
45.00    12
45.50     2
46.00     3
47.00     9
48.00     9
49.00     6
50.00    10
51.00     7
52.00     6
53.00     1
54.00     8
55.00     2
55.50     1
56.00     4
57.00     2
58.00     5
59.00     2
60.00     4
61.00     3
62.00     4
63.00     2
64.00     2
65.00     3
66.00     1
70.00     2
70.50     1
71.00     2
74.00     1
80.00     1
Name: age, dtype: int64

In [26]:
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [27]:
titanic['alive'].value_counts()

no     549
yes    342
Name: alive, dtype: int64

Exercise 4.4.3

In [28]:
# n1. 
titanic['age'].mean()

29.69911764705882

In [29]:
titanic.loc[titanic['sex'] == 'female', 'age'].mean()

27.915708812260537

In [30]:
titanic.loc[(titanic['sex'] == 'female')&
           (titanic['class'] == 'First'), 'age'].mean()

34.61176470588235

Exercise 4.4.4

In [31]:
titanic['category1'] = titanic.apply(lambda x : x.sex if (x.age >= 20)
                                    else "child", axis = 1)
titanic.category1

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887     child
888     child
889      male
890      male
Name: category1, Length: 891, dtype: object

Exercise 4.4.5

In [32]:
mean_age = round(titanic['age'].mean())
titanic['age'].fillna(mean_age, inplace = True)

Exercise 4.4.6

In [33]:
titanic.category2 = titanic.sex + titanic.age.astype(str)
titanic.category2

0        male22.0
1      female38.0
2      female26.0
3      female35.0
4        male35.0
          ...
886      male27.0
887    female19.0
888    female30.0
889      male26.0
890      male32.0
Length: 891, dtype: object

Exercise 4.4.7

In [44]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

titanic['age_group'] = pd.cut(titanic.age, bins, labels = labels)
titanic.age_group.value_counts(normalize = True)

청년      0.464082
중년      0.274800
미성년자    0.188141
장년      0.067275
노년      0.005701
Name: age, dtype: float64

In [45]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,age_group
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,청년
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,중년
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,청년
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,중년
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,중년

Exercise 4.4.8

In [48]:
titanic.category3 = titanic.apply(lambda x : x.age_group if x.age < 20 
                                 else x.age_group + x.sex, axis = 1)
titanic.category3

0        청년male
1      중년female
2      청년female
3      중년female
4        중년male
         ...
886      청년male
887        미성년자
888    청년female
889      청년male
890      중년male
Length: 891, dtype: object

# Chap4.5

Exercise 4.5.1

In [56]:
df_score1 = pd.DataFrame({
    "철수" : [40, 100, 80],
    "영희" : [30, 90, 70],
    "길동" : [80, 80, 80],
    "가연" : [90, 100, 90],
    "희철" : [100, 100, 100]
})
df_score1.index = ['국어', '영어', '수학']
df_score2 = df_score1.reset_index()
df_score2

  index   철수  영희  길동   가연   희철
0    국어   40  30  80   90  100
1    영어  100  90  80  100  100
2    수학   80  70  80   90  100

In [57]:
df_score2 = df_score2.set_index("index")
df_score2

        철수  영희  길동   가연   희철
index
국어      40  30  80   90  100
영어     100  90  80  100  100
수학      80  70  80   90  100

Exercise 4.5.2

In [66]:
df_score3 = pd.DataFrame({
    "반" : [1, 1, 2, 3, 4],
    "번호" : [3, 21, 2, 3, 1],
    "국어" : [30, 100, 80, 80, 70],
    "영어" : [70, 70, 90, 90, 60],
    "수학" : [100, 100, 90, 30, 70]
})
df_score3

   반  번호   국어  영어   수학
0  1   3   30  70  100
1  1  21  100  70  100
2  2   2   80  90   90
3  3   3   80  90   30
4  4   1   70  60   70

In [73]:
df_score4 = pd.DataFrame({
    "국어" : [30, 100, 80, 80, 70],
    "영어" : [70, 70, 90, 90, 60],
    "수학" : [100, 100, 90, 30, 70]},
    index = [[1, 1, 2, 3, 4], [3, 21, 2, 3, 1]])
df_score4.index.names = ['반', '번호']
df_score4

       국어  영어   수학
반 번호
1 3    30  70  100
  21  100  70  100
2 2    80  90   90
3 3    80  90   30
4 1    70  60   70

In [75]:
df_score4['평균'] = df_score4.sum(axis = 1)/3
df_score4

       국어  영어   수학         평균
반 번호
1 3    30  70  100  66.666667
  21  100  70  100  90.000000
2 2    80  90   90  86.666667
3 3    80  90   30  66.666667
4 1    70  60   70  66.666667

In [81]:
df_score5 = df_score4.unstack('반')
df_score5.loc['평균', :] = df_score5.mean(axis = 0)
df_score5

       국어                      영어                       수학                    \
반       1     2     3     4     1     2     3     4      1     2     3     4
번호
1     NaN   NaN   NaN  70.0   NaN   NaN   NaN  60.0    NaN   NaN   NaN  70.0
2     NaN  80.0   NaN   NaN   NaN  90.0   NaN   NaN    NaN  90.0   NaN   NaN
3    30.0   NaN  80.0   NaN  70.0   NaN  90.0   NaN  100.0   NaN  30.0   NaN
21  100.0   NaN   NaN   NaN  70.0   NaN   NaN   NaN  100.0   NaN   NaN   NaN
평균   65.0  80.0  80.0  70.0  70.0  90.0  90.0  60.0  100.0  90.0  30.0  70.0

           평균
반           1          2          3          4
번호
1         NaN        NaN        NaN  66.666667
2         NaN  86.666667        NaN        NaN
3   66.666667        NaN  66.666667        NaN
21  90.000000        NaN        NaN        NaN
평균  78.333333  86.666667  66.666667  66.666667

# Chap4.6

Exercise 4.6.1

In [91]:
df1 = pd.DataFrame(
    np.random.randint(10, size = (5,5))
)
df1.columns = ['서울', '김해', '대전', '울산', '세종']
df1['서울'] = [1,2,3,4,5]
df1

   서울  김해  대전  울산  세종
0   1   1   6   2   1
1   2   8   1   4   3
2   3   1   8   5   5
3   4   9   2   4   3
4   5   3   2   8   3

In [92]:
df2 = pd.DataFrame(
    np.random.randint(20, size = (5,5))
)
df2.columns = ['서울특별시', '광주', '영덕', '강릉', '목포']
df2['서울특별시'] = [1,2,3,4,5]
df2

   서울특별시  광주  영덕  강릉  목포
0      1  12   4   9  15
1      2  17   7   3  16
2      3  15   6  19  14
3      4   1  16  12   8
4      5  16   0   1  19

In [94]:
pd.merge(df1, df2, left_on = '서울', right_on = '서울특별시')

   서울  김해  대전  울산  세종  서울특별시  광주  영덕  강릉  목포
0   1   1   6   2   1      1  12   4   9  15
1   2   8   1   4   3      2  17   7   3  16
2   3   1   8   5   5      3  15   6  19  14
3   4   9   2   4   3      4   1  16  12   8
4   5   3   2   8   3      5  16   0   1  19

Exercise 4.6.2

In [107]:
df_gradef = pd.DataFrame({
    "매출" : [30, 20, 50, 60, 70, 80],
    "비용" : [50, 60, 40, 30, 30, 20]},
    index = ['1월', '2월', '3월', '4월', '5월', '6월'])
df_gradef["이익"] = df_gradef['매출'] - df_gradef['비용']

df_gradel = pd.DataFrame({
    "매출" : [80, 90, 70, 70, 100, 120],
    "비용" : [20, 20, 40, 40, 10, 10]},
    index = ['7월', '8월', '9월', '10월', '11월', '12월'])
df_gradel["이익"] = df_gradel['매출'] - df_gradel['비용']

df_total = pd.concat([df_gradef, df_gradel])
df_total.loc['총실적', :] = df_total.sum(axis = 0)
df_total

        매출     비용     이익
1월    30.0   50.0  -20.0
2월    20.0   60.0  -40.0
3월    50.0   40.0   10.0
4월    60.0   30.0   30.0
5월    70.0   30.0   40.0
6월    80.0   20.0   60.0
7월    80.0   20.0   60.0
8월    90.0   20.0   70.0
9월    70.0   40.0   30.0
10월   70.0   40.0   30.0
11월  100.0   10.0   90.0
12월  120.0   10.0  110.0
총실적  840.0  370.0  470.0

# Chap4.7

Exercise 4.7.1

In [108]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [113]:
res_df = pd.DataFrame(df2.groupby('key1').sum()['data1'])
res_df

      data1
key1
A         8
B         7

Exercise 4.7.2

In [115]:
import seaborn as sns
iris = sns.load_dataset("iris")
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [118]:
iris.groupby('species').mean()[['sepal_length', 'sepal_width']]

            sepal_length  sepal_width
species
setosa             5.006        3.428
versicolor         5.936        2.770
virginica          6.588        2.974

Exercise 4.7.3

In [119]:
tips = sns.load_dataset("tips")
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [125]:
tips['tip_pct'] = round(tips['tip']/tips['total_bill'],3)*100
tips.pivot_table('tip_pct', ['day', 'time'], 'size')

size            1          2          3          4     5          6
day  time
Thur Lunch   18.2  16.402128  14.475000  14.540000  12.1  17.366667
     Dinner   NaN  16.000000        NaN        NaN   NaN        NaN
Fri  Lunch   22.4  18.200000  18.800000        NaN   NaN        NaN
     Dinner   NaN  16.272727        NaN  11.800000   NaN        NaN
Sat  Dinner  23.2  15.528302  15.150000  13.815385  10.7        NaN
Sun  Dinner   NaN  18.089744  15.273333  15.311111  16.0  10.400000

Exercise 4.7.4

In [133]:
titanic = sns.load_dataset("titanic")
titanic['age_group'] = pd.qcut(titanic.age, 3, labels = ['청년', '장년', '노년'])
titanic.pivot_table('survived', ['sex', 'age_group'], 'class', aggfunc = 'mean')*100

class                 First      Second      Third
sex    age_group
female 청년         95.454545  100.000000  50.847458
       장년         94.736842   90.909091  48.148148
       노년         97.727273   85.714286  25.000000
male   청년         50.000000   35.714286  15.887850
       장년         50.000000    7.692308  19.565217
       노년         34.782609    6.250000   5.555556

# Chap4.8

Exercise 4.8.1

In [136]:
np.random.seed(0)
df = pd.DataFrame({
    "date": pd.date_range("2020-12-25", periods=100, freq="D"), 
    "value": np.random.randint(100, size=(100,))
})
df.head()

        date  value
0 2020-12-25     44
1 2020-12-26     47
2 2020-12-27     64
3 2020-12-28     67
4 2020-12-29     67

In [138]:
df.groupby(pd.Grouper(key = 'date', freq = '1M')).sum()

            value
date
2020-12-31    381
2021-01-31   1811
2021-02-28    985
2021-03-31   1500
2021-04-30    146